sechshelme/Lazarus-Embedded/test/AVR_Fuse/XML/attiny28.xml
<?xml version="1.0" encoding="UTF-8"?>
<avr-tools-device-file xmlns:xalan="http://xml.apache.org/xalan" xmlns:NumHelper="NumHelper" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant tempmin="0" tempmax="0" speedmax="0" pinout="" package="" ordercode="standard" vccmin="2.7" vccmax="5.5"/>
  </variants>
  <devices>
    <device name="ATtiny28" architecture="AVR8" family="tinyAVR">
      <address-spaces>
        <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x0800">
          <memory-segment start="0x0000" size="0x0800" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x00"/>
        </address-space>
        <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
          <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
        </address-space>
        <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="fuses" rw="RW" exec="0" name="FUSES"/>
        </address-space>
        <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
          <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
        </address-space>
        <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0060">
          <memory-segment external="0" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
          <memory-segment name="MAPPED_IO" start="0x0020" size="0x0040" type="io" external="0"/>
        </address-space>
        <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
      </address-spaces>
      <peripherals>
        <module name="PORTD">
          <instance name="PORTD">
            <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="CPU">
          <instance name="CPU">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="ANALOG_COMPARATOR">
          <instance name="ANALOG_COMPARATOR">
            <register-group name="ANALOG_COMPARATOR" name-in-module="ANALOG_COMPARATOR" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="TIMER_COUNTER_0">
          <instance name="TIMER_COUNTER_0">
            <register-group name="TIMER_COUNTER_0" name-in-module="TIMER_COUNTER_0" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="WATCHDOG">
          <instance name="WATCHDOG">
            <register-group name="WATCHDOG" name-in-module="WATCHDOG" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="EXTERNAL_INTERRUPT">
          <instance name="EXTERNAL_INTERRUPT">
            <register-group name="EXTERNAL_INTERRUPT" name-in-module="EXTERNAL_INTERRUPT" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="PORTA">
          <instance name="PORTA">
            <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="PORTB">
          <instance name="PORTB">
            <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="MODULATOR">
          <instance name="MODULATOR">
            <register-group name="MODULATOR" name-in-module="MODULATOR" offset="0x00" address-space="data"/>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"/>
          </instance>
        </module>
      </peripherals>
      
      
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
        <interrupt index="1" name="INT0" caption="External Interrupt 0"/>
        <interrupt index="2" name="INT1" caption="External Interrupt 1"/>
        <interrupt index="3" name="LOW_LEVEL_IO_PINS" caption="Low-level Input on Port B"/>
        <interrupt index="4" name="TIMER0_OVF" caption="Timer/Counter0 Overflow"/>
        <interrupt index="5" name="ANA_COMP" caption="Analog Comparator"/>
      </interrupts>
      <interfaces>
        <interface name="HVPP" type="hvpp"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x91"/>
          <property name="SIGNATURE2" value="0x07"/>
        </property-group>
        <property-group name="PP_INTERFACE">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="0"/>
          <property name="PpEnterProgMode_toggleVtg" value="0"/>
          <property name="PpEnterProgMode_powerOffDelay" value="0"/>
          <property name="PpEnterProgMode_resetDelayMs" value="0"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="10"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x00"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x00"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="5"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="5"/>
        </property-group>
        <property-group name="PP_INTERFACE_STK600">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="0"/>
          <property name="PpEnterProgMode_toggleVtg" value="0"/>
          <property name="PpEnterProgMode_powerOffDelay" value="0"/>
          <property name="PpEnterProgMode_resetDelayMs" value="0"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="2"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x00"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x00"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="1"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="1"/>
        </property-group>
        <property-group name="PP_INTERFACE_AVRDRAGON">
          <property name="PpControlStack" value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x0C 0x01 0x00 0x00 0x00 0x00"/>
          <property name="PpEnterProgMode_stabDelay" value="100"/>
          <property name="PpEnterProgMode_progModeDelay" value="0"/>
          <property name="PpEnterProgMode_latchCycles" value="0"/>
          <property name="PpEnterProgMode_toggleVtg" value="0"/>
          <property name="PpEnterProgMode_powerOffDelay" value="0"/>
          <property name="PpEnterProgMode_resetDelayMs" value="0"/>
          <property name="PpEnterProgMode_resetDelayUs" value="0"/>
          <property name="PpLeaveProgMode_stabDelay" value="15"/>
          <property name="PpLeaveProgMode_resetDelay" value="15"/>
          <property name="PpChipErase_pulseWidth" value="0"/>
          <property name="PpChipErase_pollTimeout" value="10"/>
          <property name="PpProgramFlash_pollTimeout" value="5"/>
          <property name="PpProgramFlash_mode" value="0x00"/>
          <property name="PpProgramFlash_blockSize" value="256"/>
          <property name="PpReadFlash_blockSize" value="256"/>
          <property name="PpProgramEeprom_pollTimeout" value="5"/>
          <property name="PpProgramEeprom_mode" value="0x00"/>
          <property name="PpProgramEeprom_blockSize" value="256"/>
          <property name="PpReadEeprom_blockSize" value="256"/>
          <property name="PpProgramFuse_pulseWidth" value="0"/>
          <property name="PpProgramFuse_pollTimeout" value="5"/>
          <property name="PpProgramLock_pulseWidth" value="0"/>
          <property name="PpProgramLock_pollTimeout" value="5"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="" name="FUSE">
      <register-group caption="" name="FUSE">
        <register caption="" name="LOW" offset="0x00" size="1">
          <bitfield caption="Internal load capacitors between XTAL1/XTAL2 and GND" mask="0x10" name="INTCAP"/>
          <bitfield caption="Clock Select" mask="0x0F" name="CKSEL" values="ENUM_SUT_CKSEL"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_SUT_CKSEL">
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0F"/>
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0E"/>
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0D"/>
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0C"/>
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0B"/>
        <value caption="External Crystal / Ceramic Resonator" name="EXTXTALCRES" value="0x0A"/>
        <value caption="External Low-Frequency Crystal" name="EXTLOFXTAL" value="0x09"/>
        <value caption="External Low-Frequency Crystal" name="EXTLOFXTAL" value="0x08"/>
        <value caption="External RC Ocsillator" name="EXTRCOSC" value="0x07"/>
        <value caption="External RC Ocsillator" name="EXTRCOSC" value="0x06"/>
        <value caption="External RC Ocsillator" name="EXTRCOSC" value="0x05"/>
        <value caption="Internal RC Ocsillator" name="INTRCOSC" value="0x04"/>
        <value caption="Internal RC Ocsillator" name="INTRCOSC" value="0x03"/>
        <value caption="Internal RC Ocsillator" name="INTRCOSC" value="0x02"/>
        <value caption="External Clock" name="EXTCLK" value="0x01"/>
        <value caption="External Clock" name="EXTCLK" value="0x00"/>
      </value-group>
    </module>
    <module caption="" name="LOCKBIT">
      <register-group caption="" name="LOCKBIT">
        <register caption="" name="LOCKBIT" offset="0x00" size="1">
          <bitfield caption="Memory Lock" mask="0x06" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group caption="" name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x01"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="" name="PORTD">
      <register-group caption="" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x12" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x11" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x10" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="" name="CPU">
      <register-group caption="" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x3F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Interrupt Control Register" name="ICR" offset="0x06" size="1">
          <bitfield caption="Interrupt Sense Control 1 bits" mask="0x0C" name="ICS1" values="INTERRUPT_SENSE_CONTROL2"/>
          <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
        </register>
        <register caption="MCU Control and Status Register" name="MCUCS" offset="0x07" size="1">
          <bitfield caption="Pull-up Enable Port B" mask="0x80" name="PLUPB"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode" mask="0x10" name="SM"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Status Register" name="OSCCAL" offset="0x00" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
        <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
        <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
        <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
        <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="" name="ANALOG_COMPARATOR">
      <register-group caption="" name="ANALOG_COMPARATOR">
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x08" size="1">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="" name="TIMER_COUNTER_0">
      <register-group caption="" name="TIMER_COUNTER_0">
        <register caption="Interrupt Control Register" name="ICR" offset="0x06" size="1">
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x10" name="TOIE0"/>
        </register>
        <register caption="Interrupt Flag register" name="IFR" offset="0x05" size="1">
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x10" name="TOV0"/>
        </register>
        <register caption="Timer/Counter0 Control Register" name="TCCR0" offset="0x04" size="1">
          <bitfield caption="Force Overflow" mask="0x80" name="FOV0"/>
          <bitfield caption="Overflow Output Mode, Bits" mask="0x18" name="OOM0" values="CLK_COMP_MATCH_OUT_MODE"/>
          <bitfield caption="Clock Select0 bits" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT_MOD"/>
        </register>
        <register caption="Timer Counter 0" name="TCNT0" offset="0x03" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="CLK_COMP_MATCH_OUT_MODE">
        <value caption="Disconnected from OCn/PWMn" name="VAL_0x00" value="0x00"/>
        <value caption="Toggle OCn/PWMn output line" name="VAL_0x01" value="0x01"/>
        <value caption="Clear OCn/PWMn output line" name="VAL_0x02" value="0x02"/>
        <value caption="set OCn/PWMn output line" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT_MOD">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, Modulator Period" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="" name="WATCHDOG">
      <register-group caption="" name="WATCHDOG">
        <register caption="Watchdog Timer Control Register" name="WDTCR" offset="0x01" size="1">
          <bitfield caption="RW" mask="0x10" name="WDTOE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
          <bitfield caption="Watch Dog Timer Prescaler bits" mask="0x07" name="WDP" values="WDOG_TIMER_PRESCALE_3BITS"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_3BITS">
        <value caption="Oscillator Cycles 16K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 2048K" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="" name="EXTERNAL_INTERRUPT">
      <register-group caption="" name="EXTERNAL_INTERRUPT">
        <register caption="Interrupt Control Register" name="ICR" offset="0x06" size="1">
          <bitfield caption="External Interrupt Request 1 Enable" mask="0xC0" name="INT"/>
          <bitfield caption="Low-level Input Interrupt Enable" mask="0x20" name="LLIE"/>
        </register>
        <register caption="Interrupt Flag register" name="IFR" offset="0x05" size="1">
          <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
        </register>
      </register-group>
    </module>
    <module caption="" name="PORTA">
      <register-group caption="" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x1B" size="1" mask="0x0F"/>
        <register caption="Port A Control Register" name="PACR" offset="0x1A" size="1" mask="0x0F"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x19" size="1" mask="0x0B"/>
      </register-group>
    </module>
    <module caption="" name="PORTB">
      <register-group caption="" name="PORTB">
        <register caption="Port B Input Pins" name="PINB" offset="0x16" size="1" mask="0xFF"/>
      </register-group>
    </module>
    <module caption="" name="MODULATOR">
      <register-group caption="" name="MODULATOR">
        <register caption="Modulation Control Register" name="MODCR" offset="0x02" size="1">
          <bitfield caption="Modulation On-time Bit 4" mask="0x80" name="ONTIM4"/>
          <bitfield caption="Modulation On-time Bit 3" mask="0x40" name="OTIM3"/>
          <bitfield caption="Modulation On-time Bits" mask="0x38" name="ONTIM"/>
          <bitfield caption="Modulation Configuration Bits" mask="0x07" name="MCONF"/>
        </register>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
